## Practice pandas from real python

In [1]:
import numpy as np
import pandas as pd

KeyboardInterrupt:

In [11]:
data = {
    "name": ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
    "city": ['Mexico city', 'Toronto', 'Prague', 'Shanghai',                                            'Manchester', 'Cairo', 'Osaka'],
    "age": [41, 28, 33, 34, 38, 31, 37],
    "py_score": [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84],
}
raw_lables = np.arange(10,17)

In [12]:
df = pd.DataFrame(data, index=raw_lables)
df

      name         city  age  py_score
10  Xavier  Mexico city   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0

In [13]:
df.memory_usage()

Index       56
name        28
city        28
age         56
py_score    56
dtype: int64

In [6]:
ali = df.loc[3]
ali

name               ali
roll_no           1026
program         BS(SE)
total_marks         10
obtain_marks         7
Name: 3, dtype: object

In [11]:
df['name'][0]

'sameer'

In [21]:
df.columns

Index(['name', 'roll_no', 'program', 'total_marks', 'obtain_marks'], dtype='object')

In [90]:
df.index = np.arange(10,14)

In [80]:
df_ = df.astype(dtype={'roll_no': np.int32, 'total_marks': np.int32, 'obtain_marks': np.float32})
df_.dtypes

name             object
roll_no           int32
program          object
total_marks       int32
obtain_marks    float32
dtype: object

In [81]:
df_.memory_usage()

Index           32
name            16
roll_no         16
program         16
total_marks     16
obtain_marks    16
dtype: int64

In [63]:
df.memory_usage()

Index           64
name            16
roll_no         32
program         16
total_marks     32
obtain_marks    32
dtype: int64

In [54]:
df.ndim

2

In [57]:
df

     name  roll_no program  total_marks  obtain_marks
0  sameer     1026  BS(SE)           10             9
1   sarab     1114  BS(SE)           10             8
2   faraz     1115  BS(SE)           10             8
3     ali     1026  BS(SE)           10             7

In [64]:
n = df_.to_numpy()

In [82]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [83]:
df.columns

Index(['name', 'roll_no', 'program', 'total_marks', 'obtain_marks'], dtype='object')

In [111]:
df.loc[:,'name':'total_marks']

      name  roll_no program  total_marks
10  sameer     1026  BS(SE)           10
11   sarab     1114  BS(SE)           10
12   faraz     1115  BS(SE)           10
13     ali     1026  BS(SE)           10

In [114]:
df.iloc[2:,:]

     name  roll_no program  total_marks  obtain_marks
12  faraz     1115  BS(SE)           10             8
13    ali     1026  BS(SE)           10             7

In [131]:
df.loc[10:15:2,['total_marks','obtain_marks']]

    total_marks  obtain_marks
10           10             9
12           10             8

In [118]:
df.loc[[10,13],['name','roll_no','obtain_marks']]

      name  roll_no  obtain_marks
10  sameer     1026             9
13     ali     1026             7

In [119]:
lis = [0,1,2,3,4,5,6,7,8,9,10]

In [130]:
lis[1::2]

[1, 3, 5, 7, 9]

In [36]:
df.at[13]

TypeError: _get_value() missing 1 required positional argument: 'col'

In [138]:
df['obtain_marks']

10    9
11    8
12    8
13    7
Name: obtain_marks, dtype: int64

In [144]:
df

      name         city  age  py_score
10  Xavier  Mexico city   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0

In [148]:
df['city']

10    Mexico city
11        Toronto
12         Prague
13       Shanghai
14     Manchester
15          Cairo
16          Osaka
Name: city, dtype: object

In [154]:
df.loc[10:15,['name','age']]

      name  age
10  Xavier   41
11     Ann   28
12    Jana   33
13      Yi   34
14   Robin   38
15    Amal   31

In [160]:
df['py_score'] = 10

In [161]:
df

      name         city  age  py_score
10  Xavier  Mexico city   41        10
11     Ann      Toronto   28        10
12    Jana       Prague   33        10
13      Yi     Shanghai   34        10
14   Robin   Manchester   38        10
15    Amal        Cairo   31        10
16    Nori        Osaka   37        10

In [166]:
a = [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84][::-1]
a

[84, 61.0, 68.0, 80.0, 81.0, 79.0, 88.0]

In [163]:
df

      name         city  age  py_score
10  Xavier  Mexico city   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0

In [164]:
df.loc[16,'city'] = 'Ousija'

In [14]:
df

      name         city  age  py_score
10  Xavier  Mexico city   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0

In [40]:
df.columns = ['name', 'city', 'age', 'py_score']

In [46]:
df.index[3:]

Int64Index([13, 14, 15, 16], dtype='int64')

In [52]:
array = np.arange(20).reshape(4,5)
array.size

20

In [53]:
df

      name         city  age  py_score
10  Xavier  Mexico city   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0

In [79]:
sameer = pd.Series(data=['sameer','Karachi', 22, 0], index=df.columns, name=12)

In [80]:
df = df.append(sameer)

      name         city  age  py_score
10  Xavier  Mexico city   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0
12  sameer      Karachi   22       0.0

In [93]:
df.drop(labels=[11])

      name         city  age  py_score
10  Xavier  Mexico city   41      88.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0
17  sameer      Karachi   22       0.0
17  sameer      Karachi   22       0.0
12  sameer      Karachi   22       0.0

In [94]:
df

      name         city  age  py_score
10  Xavier  Mexico city   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0
17  sameer      Karachi   22       0.0
17  sameer      Karachi   22       0.0
12  sameer      Karachi   22       0.0

In [96]:
df['js-score'] = np.array([11,12,13,31,55,33,45,32,12,00])
df

      name         city  age  py_score  js-score
10  Xavier  Mexico city   41      88.0        11
11     Ann      Toronto   28      79.0        12
12    Jana       Prague   33      81.0        13
13      Yi     Shanghai   34      80.0        31
14   Robin   Manchester   38      68.0        55
15    Amal        Cairo   31      61.0        33
16    Nori        Osaka   37      84.0        45
17  sameer      Karachi   22       0.0        32
17  sameer      Karachi   22       0.0        12
12  sameer      Karachi   22       0.0         0

In [97]:
df

      name         city  age  py_score  js-score
10  Xavier  Mexico city   41      88.0        11
11     Ann      Toronto   28      79.0        12
12    Jana       Prague   33      81.0        13
13      Yi     Shanghai   34      80.0        31
14   Robin   Manchester   38      68.0        55
15    Amal        Cairo   31      61.0        33
16    Nori        Osaka   37      84.0        45
17  sameer      Karachi   22       0.0        32
17  sameer      Karachi   22       0.0        12
12  sameer      Karachi   22       0.0         0

In [103]:
lemon = np.arange(10)
df.insert(loc=3, column='lemon', value=lemon)
df.insert()

In [104]:
df

      name         city  age  lemon  py_score  js-score
10  Xavier  Mexico city   41      0      88.0        11
11     Ann      Toronto   28      1      79.0        12
12    Jana       Prague   33      2      81.0        13
13      Yi     Shanghai   34      3      80.0        31
14   Robin   Manchester   38      4      68.0        55
15    Amal        Cairo   31      5      61.0        33
16    Nori        Osaka   37      6      84.0        45
17  sameer      Karachi   22      7       0.0        32
17  sameer      Karachi   22      8       0.0        12
12  sameer      Karachi   22      9       0.0         0

In [ ]:
df.drop()

In [118]:
df['js-score'] = np.array([71.0, 95.0, 88.0, 79.0, 91.0, 91.0, 80.0])

ValueError: Length of values does not match length of index

In [110]:
(0.4 * 88.0 + 0.3 * 86.0 + 0.3 * 71.0)

82.3

In [115]:
74*0.3 + 66*0.5 + 100*0.2

75.2

In [114]:
22 * 0.3 + 33 * 0.5 + 20 * 0.2

27.1